// створити функцію яка виводить масив
// - створити функцію яка заповнює масив рандомними числами та виводить його. Для виведення використати попвередню функцію.
// function masRandom(){
//     let array = [];
//     for(let i = 0;i<20;i++){
//         let x = Math.floor(Math.random()*100);
//         array[i] = x;
//     }
//     console.log(array);
// }
// masRandom();
// - створити функцію яка приймає три числа та виводить та повертає найменьше.
// function minimum( a = 0, b = 0, c = 0){
//     if(a<b&&a<c){
//         return a;
//     }else if(b<a&&b<c){
//         return b;
//     }else return c;

// }

// console.log(minimum(1,2,-1));
// створити функцію яка приймає три числа та виводить та повертає найбільше.
// function max (a = 0,b=0,c=0){
//     if(a>b && a>c){
//         return a;
//     }else if(b>a&&b>c){
//         return b;
//     }else return c;
// }

// console.log(max(320,140,25));
// створити функцію яка приймає будь-яку кількість чисел,
// повертає найменьше, а виводить найбільше